---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotAddParameterToFamily
source: html/27bcba64-492c-993b-a976-21a7817d76f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotAddParameterToFamily Property

Parameter '[Parameter]' cannot be added to the family.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotAddParameterToFamily { get; }
```